export interface Academy {
  label: string;
  directorates: string[];
}

export const ACADEMIES: Academy[] = [
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة طنجة – تطوان – الحسيمة',
    directorates: [
      'طنجة – أصيلة',
      'تطوان',
      'المضيق – الفنيدق',
      'الحسيمة',
      'شفشاون',
      'العرائش',
      'وزان',
      'الفحص – أنجرة',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة الشرق',
    directorates: [
      'وجدة – أنكاد',
      'بركان',
      'الناظور',
      'الدريوش',
      'جرادة',
      'تاوريرت',
      'فكيك',
      'جرسيف',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة فاس – مكناس',
    directorates: [
      'فاس',
      'مكناس',
      'إفران',
      'بولمان',
      'صفرو',
      'تاونات',
      'تازة',
      'الحاجب',
      'مولاي يعقوب',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة الرباط – سلا – القنيطرة',
    directorates: [
      'الرباط',
      'سلا',
      'الصخيرات – تمارة',
      'القنيطرة',
      'سيدي قاسم',
      'سيدي سليمان',
      'الخميسات',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة بني ملال – خنيفرة',
    directorates: [
      'بني ملال',
      'خنيفرة',
      'خريبكة',
      'الفقيه بن صالح',
      'أزيلال',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة الدار البيضاء – سطات',
    directorates: [
      'الدار البيضاء – أنفا',
      'الفداء – مرس السلطان',
      'عين السبع – الحي المحمدي',
      'عين الشق',
      'الحي الحسني',
      'مولاي رشيد',
      'سيدي البرنوصي',
      'بن مسيك',
      'المحمدية',
      'النواصر',
      'مديونة',
      'برشيد',
      'سطات',
      'الجديدة',
      'سيدي بنور',
      'بن سليمان',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة مراكش – آسفي',
    directorates: [
      'مراكش',
      'آسفي',
      'الصويرة',
      'قلعة السراغنة',
      'الرحامنة',
      'الحوز',
      'شيشاوة',
      'اليوسفية',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة درعة – تافيلالت',
    directorates: [
      'الراشيدية',
      'ورزازات',
      'تنغير',
      'زاكورة',
      'ميدلت',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة سوس – ماسة',
    directorates: [
      'أكادير إداوتنان',
      'إنزكان أيت ملول',
      'شتوكة أيت باها',
      'تارودانت',
      'تيزنيت',
      'طاطا',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة كلميم – واد نون',
    directorates: [
      'كلميم',
      'آسا الزاك',
      'سيدي إفني',
      'طانطان',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة العيون – الساقية الحمراء',
    directorates: [
      'العيون',
      'بوجدور',
      'السمارة',
      'طرفاية',
    ],
  },
  {
    label: 'الأكاديمية الجهوية للتربية والتكوين لجهة الداخلة – وادي الذهب',
    directorates: [
      'وادي الذهب',
      'أوسرد',
    ],
  },
];
